Documents/Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Заказы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ФормаТовара/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Остаток=ПолучитьОстаток(НаименованиеТовара);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстаток(СсылкаНаТовар)
	Возврат СсылкаНаТовар.Остатки;	
КонецФункции

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Остаток=ПолучитьОстаток(НаименованиеТовара);
КонецПроцедуры  

&НаКлиенте
Процедура Готово(Команда)
	ДобавитьВКорзину(НаименованиеТовара, Количество);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВКорзину(Товар, Кол)
	Если ПустаяСтрока(Константы.Корзина.Получить()) ИЛИ Константы.Корзина.Получить().Проведен=Истина Тогда
		Заказ=Документы.Заказы.СоздатьДокумент();
		Заказ.Дата=ТекущаяДата();
		Заказ.Записать();
		Константы.Корзина.Установить(Заказ.Ссылка);
	КонецЕсли;
	Заказ=Константы.Корзина.Получить().ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(Заказ.Товары.Найти(Товар, "Товар")) Тогда
		НоваяСтрока=Заказ.Товары.Добавить();
		НоваяСтрока.Товар=Товар;	
		НоваяСтрока.Количество=Кол;
	Иначе
		КоличествоБыло=Число(Заказ.Товары.Найти(Товар, "Товар").Количество);
		Заказ.Товары.Найти(Товар, "Товар").Количество=КоличествоБыло+Кол;
	КонецЕсли;	
	Заказ.Записать();
КонецПроцедуры
